org/README.org
#+title: Personal Site
#+description: My Personal Site
#+export_file_name: ./index.html
#+setupfile: https://danmi02.github.io/org-html-themes/org/theme-readtheorg.setup
#+property: header-args :exports both :eval never-export
#+options: num:nil

* Welcome to my Personal Site!
This is a static HTML site generated with [[https://orgmode.org/manual/Publishing.html][org-publish]]. The /readtheorg/ theme is an edited version of [[https://distro.tube/][distro.tube]], which in turn was based off of [[https://github.com/fniessen/org-html-themes][fniessen/org-html-themes]].
** There's nothing here yet
+ it's a blank page thus far
* Notes
Here are some notes I took in org that I exported to HTML.
** [[file:notes/linux/index.org][Linux Operating System]]

* TODO Things to do [1/5]
+ [X] one item
+ [ ] second item
+ [ ] third item???
+ [ ] =Fourth Item.=
+ [ ] ~Fifth Item~

 #+begin_example
This is an example.
There is some text in here.
This is the last line.
 #+end_example
