index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-15 Sat 12:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Personal Site</title>
<meta name="author" content="Daniel Min" />
<meta name="description" content="My Personal Site" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Personal Site</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6953d40">Welcome to my Personal Site!</a>
<ul>
<li><a href="#orga56928b">There&rsquo;s nothing here yet</a></li>
</ul>
</li>
<li><a href="#org687ebde">Notes</a>
<ul>
<li><a href="#org7e67483">Web Development</a></li>
<li><a href="#orgbf83f1d">Linux Operating System</a></li>
</ul>
</li>
<li><a href="#org4a4ed89"><span class="todo TODO">TODO</span> Things to do <code>[1/5]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-org6953d40" class="outline-2">
<h2 id="org6953d40">Welcome to my Personal Site!</h2>
<div class="outline-text-2" id="text-org6953d40">
<p>
This is a static HTML site generated with <a href="https://orgmode.org/manual/Publishing.html">org-publish</a>. The <i>readtheorg</i> theme is an edited version of <a href="https://distro.tube/">distro.tube</a>, which in turn was based off of <a href="https://github.com/fniessen/org-html-themes">fniessen/org-html-themes</a>.
</p>
</div>
<div id="outline-container-orga56928b" class="outline-3">
<h3 id="orga56928b">There&rsquo;s nothing here yet</h3>
<div class="outline-text-3" id="text-orga56928b">
<ul class="org-ul">
<li>it&rsquo;s a blank page thus far</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org687ebde" class="outline-2">
<h2 id="org687ebde">Notes</h2>
<div class="outline-text-2" id="text-org687ebde">
<p>
Here are some notes I took in org that I exported to HTML.
</p>
</div>
<div id="outline-container-org7e67483" class="outline-3">
<h3 id="org7e67483"><a href="notes/web/index.html">Web Development</a></h3>
</div>
<div id="outline-container-orgbf83f1d" class="outline-3">
<h3 id="orgbf83f1d"><a href="notes/linux/index.html">Linux Operating System</a></h3>
</div>
</div>

<div id="outline-container-org4a4ed89" class="outline-2">
<h2 id="org4a4ed89"><span class="todo TODO">TODO</span> Things to do <code>[1/5]</code></h2>
<div class="outline-text-2" id="text-org4a4ed89">
<ul class="org-ul">
<li class="on"><code>[X]</code> one item</li>
<li class="off"><code>[&#xa0;]</code> second item</li>
<li class="off"><code>[&#xa0;]</code> third item???</li>
<li class="off"><code>[&#xa0;]</code> <code>Fourth Item.</code></li>
<li class="off"><code>[&#xa0;]</code> <p>
<code>Fifth Item</code>
</p>

<pre class="example" id="org04a0328">
This is an example.
There is some text in here.
This is the last line.
</pre></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Min</p>
<p class="date">Created: 2024-06-15 Sat 12:05</p>
</div>
</body>
</html>
